rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Deadpool"], ["rating", "R"], ["created_at", "2016-03-01 20:07:03.128217"], ["updated_at", "2016-03-01 20:07:03.128217"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
---
  def search_directors
    @movie = Movie.find(params[:movie_id])
    if @movie.director.nil? || @movie.director.empty?